Repository: ilzyukin/bwapp2
Catalog: messages.po
Languages: ru_ru

source: char
ru_ru: привет

source: bWAPP - Broken Authentication
ru_ru: BWAPP - Уязвимая Аутентификация

source: Very good !
ru_ru: Очень крутое веб-приложение!

source: New user
ru_ru: Новый пользователь

source: New User
ru_ru: Новый пользователь

source: Information
ru_ru: Информация

source: Info
ru_ru: Информация

source: Training
ru_ru: Тренировочные задания

source: Talks & Training
ru_ru: Обсуждения & Обучение

source: Blog
ru_ru: Блог

source: Enter your credentials
ru_ru: Введите Ваши данные

source: Enter your credentials.
ru_ru: Введите Ваши данные.

source: password
ru_ru: Пароль

source: low
ru_ru: низкий

source: middle
ru_ru: средний

source: high
ru_ru: высокий

source: bWAPP - Change Password
ru_ru: BWAPP - Измените пароль

source: bWAPP
ru_ru: БИВАП

source: an extremely buggy web app !
ru_ru: очень дырявое приложение

source: Bugs
ru_ru: Баги

source: Change Password
ru_ru: Изменить пароль

source: Create User
ru_ru: Создать пользователя

source: Set Security Level
ru_ru: Уровень безопасности

source: bWAPP - Set Security Level
ru_ru: bWAPP - Установка уровня безопасности

source: Reset
ru_ru: Сбросить

source: Credits
ru_ru: Контактные данные

source: Logout
ru_ru: Выйти из аккаунта

source: Welcome
ru_ru: Добро пожаловать

source: Please change your password
ru_ru: Пожалуйста измените Ваш пароль

source: Current password:
ru_ru: Текущий пароль

source: New password:
ru_ru: Новый пароль:

source: Re-type new password:
ru_ru: Введите новый пароль повторно:

source: Invalid credentials or user not activated!
ru_ru: Неверные учетные данные или пользователь не активирован!

source: bWAPP is licensed under
ru_ru: Лицензия БИВАП от

source: 2014 MME BVBA / Follow
ru_ru: 2014 MME BVBA / Подписывайтесь

source: on Twitter and ask for our cheat sheet, containing all solutions! / Need an exclusive
ru_ru: на мой Twitter и попросите нашу шпаргалку, содержащую все решения! / Нужна эксклюзивная

source: on Twitter and ask for our cheat sheet, containing all solutions! / Need an exclusive
ru_ru: на мой Twitter и попросите нашу шпаргалку, содержащую все решения! / Нужна эксклюзивная

source: Check security level
ru_ru: Проверьте уровень безопасности:

source: training
ru_ru: тренировка

source: Set
ru_ru: Установить

source: Current:
ru_ru: Текущий

source: Change:
ru_ru: Изменить

source: Broken Auth. - CAPTCHA Bypassing
ru_ru: Уязвимая аутентификация - обход капчи

source: Login:
ru_ru: Логин:

source: Password:
ru_ru: Пароль:

source: Re-enter CAPTCHA:
ru_ru: Повторно введите капчу:

source: CAPTCHA:
ru_ru: Капча:

source: Login
ru_ru: Логин/вход

source: Set your security level:
ru_ru: Введите Ваш уровень безопасности:

source: medium
ru_ru: средний

source: Broken Auth. - Forgotten Function
ru_ru: Уязвимая аутентификация - забытая функция

source: Apparently you forgot your secret...
ru_ru: Очевидно, Вы забыли свой секрет...

source: E-mail:
ru_ru: Почта:

source: Forgot
ru_ru: Забыл свои данные

source: Registration
ru_ru: Регистрация

source: Broken Auth. - Insecure Login Forms
ru_ru: Опасный вход

source: bWAPP - New User
ru_ru: BWAPP - новый пользователь

source: Create a new user.
ru_ru: Создать нового пользователя

source: Re-type password:
ru_ru: Повторите пароль:

source: Secret
ru_ru: Секретное слово

source: E-mail activation:
ru_ru: Активация e-mail

source: Create
ru_ru: Создать

source: A.I.M., or Authentication Is Missing, is a no-authentication mode that can be used for testing web scanners and crawlers.
ru_ru: A.I.M., or Authentication Is Missing, безауттонтификационный способоб, используемый для тестирования веб-приложений и поисковиков.

source: Steps to crawl all pages, and to detect all vulnerabilities without authentication:
ru_ru: Шаги для того, чтобы обнаружить все страницы и уязвиомсти без аутентификации

source: 1. Change the IP address in the settings file (admin/settings.php) to your IP address:
ru_ru: 1. Изменить ip адрес в настроечном файле (admin/settings.php) на свой

source: 2. Point your web scanner, crawler or attack tool to this URL:
ru_ru: 2. Перейдите по данному URL

source: 3. Push the button: all hell breaks loose...
ru_ru: 3. Нажмите кнопку.....

source: Name:
ru_ru: Имя:

source: Passphrase
ru_ru: Секретная фраза

source: REnter the correct passphrase to unlock the secret.
ru_ru: Повторите секретную фразу, чтобы разблокировать пароль

source: Broken Auth. - Logout Management
ru_ru: Прерванная аутентификация - управление выходом

source: Click
ru_ru: Нажмите

source: here
ru_ru: сюда

source: to logout.
ru_ru: чтобы выйти

source: Broken Auth. - Password Attacks
ru_ru: Прерванная аутентификация - Атаки на пароль

source: Broken Auth. - Weak Passwords
ru_ru: Прерванная аутентификация - Ненадежный пароль

source: bWAPP - Buffer Overflow
ru_ru: BWAPP - Переполнение буфера

source: Buffer Overflow (Local)
ru_ru: Переполнение буфера (Локальное BOF)

source: Search for a movie:
ru_ru: Поиск фильма:

source: Search
ru_ru: Искать

source: only
ru_ru: только

source: Buffer Overflow (Remote)
ru_ru: Переполнение буфера (Удаленное BOF)

source: A specific bWAPP network service is vulnerable to a remote buffer overflow. Get r00t!
ru_ru: Конкретная сетевая служба bWAPP уязвима к удаленному переполнению буфера. Получите права root!

source: HINT:
ru_ru: ПОДСКАЗКА:

source: [payload]
ru_ru: [полезная нагрузка]

source: Thanks to David Bloom (@philophobia78) for developing the C++ BOF application!
ru_ru: Спасибо Дэвиду Блуму (@philophobia78) за разработку C++ BOF приложения!

source: bWAPP - CAPTCHA box
ru_ru: BWAPP - Поле ввода капчи

source: bWAPP - ClickJacking
ru_ru: BWAPP - Кликджекинг

source: ClickJacking (Movie Tickets)
ru_ru: Кликджекинг (Билеты в кино)

source: How many movie tickets would you like to order?
ru_ru: Сколько билетов в кино Вы хотели бы заказать?

source: EUR per ticket
ru_ru: Евро за билет

source: I would like to order
ru_ru: Мне хотелось бы заказать

source: tickets.
ru_ru: билетов.

source: HINT: open the evil
ru_ru: ПОДСКАЗКА: откройте зло

source: ClickJacking page
ru_ru: Кликджекинг страница

source: in a new tab...
ru_ru: в новой вкладке...

source: Confirm
ru_ru: Подтвердить

source: bWAPP - OS Command Injection
ru_ru: BWAPP - Инъекция команд в операционную систему

source: OS Command Injection
ru_ru: Инъекция команд в операционную систему

source: DNS lookup:
ru_ru: Поиск DNS:

source: Lookup
ru_ru: Поиск

source: OS Command Injection - Blind
ru_ru: Слепая инъекция команд в операционную систему

source: Enter your IP address:
ru_ru: Введите свой IP-адрес:

source: PING
ru_ru: ПИНГ

source: bWAPP - Credits
ru_ru: BWAPP - Контактные данные

source: O yeah... who am I? Well my name is Malik. I'm a security consultant working for my own company,
ru_ru: О да... кто я такой? Ну меня зовут Малик. Я консультант по безопасности, работаю в своей компании,

source: We are specialized in Penetration Testing, Ethical Hacking, InfoSec Training, and Evil Bee Hunting.
ru_ru: Мы специализируемся на испытании на проникновение, этическом хакинге, обучении информационной безопасности и охоте на злых пчел.

source: Download our
ru_ru: Скачайте нашу книгу

source: What is bWAPP?
ru_ru: Что такое BWAPP?. Это

source: introduction tutorial, including free materials and exercises...
ru_ru: Вводное руководство, в том числе бесплатные материалы и упражнения...

source: I'm also happy to give bWAPP talks and workshops at your security convention or seminar!
ru_ru: Я также рад провести bWAPP лекции и семинары на вашей конференции или семинаре по безопасности!

source: Need a training? We offer the following exclusive courses and workshops (on demand, at your location):
ru_ru: Нужна тренировка? Мы предлагаем следующие эксклюзивные курсы и семинары (по запросу, в вашем регионе):

source: Attacking & Defending Web Apps with bWAPP : 2-day Web Application Security course
ru_ru: Атака и Защита веб-приложений с помощью bWAPP: 2-дневный курс безопасности веб-приложений

source: Plant the Flags with bWAPP : 4-hour offensive Web Application Hacking workshop
ru_ru: Установите флаги с bWAPP : 4-часовой агрессивный семинар по взлому веб-приложений

source: Ethical Hacking Basics : 1-day Ethical Hacking course
ru_ru: Основы этического взлома: 1-дневный курс этического взлома

source: Ethical Hacking Advanced : 1-day comprehensive Ethical Hacking course
ru_ru: Продвинутый этичный хакинг : 1-дневных всесторонний курс этического взлома

source: Windows Server 2012 Security : 2-day Windows Security course
ru_ru: Безопасность Windows Server 2012: 2-дневный курс безопасности Windows

source: Special thanks to the Netsparker team!
ru_ru: Особая благодарность команде Netsparker!

source: bWAPP - Client-Side Validation
ru_ru: BWAPP - Валидация на стороне клиента

source: Client-Side Validation (Password)
ru_ru: Валидация на стороне клиента (Пароль)

source: Change
ru_ru: Изменить

source: bWAPP - CSRF
ru_ru: BWAPP - CSRF (межсайтовая подделка запроса)

source: CSRF (Change Password)
ru_ru: CSRF (Смена пароля)

source: Change your password.
ru_ru: Изменить пароль.

source: CSRF (Transfer Amount)
ru_ru: CSRF (Сумма перевода)

source: Amount on your account:
ru_ru: Сумма на вашем счете:

source: EUR
ru_ru: Евро

source: Account to transfer:
ru_ru: Счет для перевода:

source: Amount to transfer:
ru_ru: Сумма для перевода:

source: Thanks for your interest in bWAPP!
ru_ru: Спасибо за Ваш интерес в Bwapp!

source: CSRF (Change Secret)
ru_ru: CSRF (Изменить секрет)

source: Change your secret.
ru_ru: Измените ваш секрет.

source: New secret:
ru_ru: Новый секрет:

source: bWAPP - Missing Functional Level Access Control
ru_ru: BWAPP - Отсутствие контроля доступа к функциональному уровню

source: Directory Traversal - Files
ru_ru: Обход каталогов - Файлы

source: Directory Traversal - Directories
ru_ru: Обход каталогов - Каталоги

source: bWAPP - Heartbleed Vulnerability
ru_ru: BWAPP - уязвимость Heartbleed (уязвимость в протоколе OpenSSL)

source: Heartbleed Vulnerability
ru_ru: Уязвимость Heartbleed

source: The Nginx web server is using a vulnerable OpenSSL version!
ru_ru: Веб-сервер Nginx использует уязвимую версию OpenSSL!

source: HINT: login on port 8443 and launch the
ru_ru: ПОДСКАЗКА: зайдите на порт 8443 и запустите

source: attack script
ru_ru: сценарий атаки

source: bWAPP - Host Header Attacks
ru_ru: BWAPP - Атаки заголовка хоста

source: Host Header Attack (Cache Poisoning)
ru_ru: Атака заголовка хоста (отравление кэша)

source: to go back to the portal.
ru_ru: чтобы вернуться к порталу.

source: Host Header Attack (Reset Poisoning)
ru_ru: Атака заголовка хоста (сброс отправления)

source: Enter your e-mail to reset and change your secret.
ru_ru: Введите свой адрес электронной почты, чтобы сбросить и изменить секрет.

source: bWAPP - HTTP Parameter Pollution
ru_ru: BWAPP - Загрязнение границ HTTP-параметров (НРР)

source: HTTP Parameter Pollution
ru_ru: Загрязнение границ HTTP-параметров (НРР)

source: In order to vote for your favorite movie, your name must be entered:
ru_ru: Для того, чтобы проголосовать за ваш любимый фильм, необходимо ввести ваше имя:

source: Title
ru_ru: Название

source: Release
ru_ru: Выпуск

source: Continue
ru_ru: Продолжить

source: Character
ru_ru: Персонаж

source: Genre
ru_ru: Жанр

source: Vote
ru_ru: Голосование

source: bWAPP - HTML Injection
ru_ru: BWAPP - HTML инъекция

source: HTML Injection - Reflected (URL)
ru_ru: HTML инъекция - Отраженный (URL)

source: HTML Injection - Reflected (GET)
ru_ru: HTML инъекция - Отраженный (GET)

source: Enter your first and last name:
ru_ru: Введите свои имя и фамилию:

source: First name:
ru_ru: Имя:

source: Last name:
ru_ru: Фамилия:

source: Go
ru_ru: Подтвердить

source: HTML Injection - Reflected (POST)
ru_ru: HTML инъекция - Отраженный (POST)

source: HTML Injection - Stored (Blog)
ru_ru: HTML инъекция - Сохраненный (Блог)

source: Submit
ru_ru: Подтвердить

source: Add:
ru_ru: Добавить:

source: Show all:
ru_ru: Показать все:

source: Delete:
ru_ru: Удалить:

source: Owner
ru_ru: Владелец

source: Date
ru_ru: Дата

source: Entry
ru_ru: Запись

source: bWAPP - HTTP Response Splitting
ru_ru: BWAPP - Расщепление HTTP-запроса

source: HTTP Response Splitting
ru_ru: Расщепление HTTP-запроса

source: Try to get the
ru_ru: Попробуйте получить

source: new line detected
ru_ru: новую строку обнаруженного

source: warning...
ru_ru: предупреждения...

source: Visit our
ru_ru: Посетите наш

source: blog
ru_ru: блог

source: bWAPP - HTTP Verb Tampering
ru_ru: BWAPP - HTTP Verb Фальсификация

source: HTTP Verb Tampering
ru_ru: HTTP Verb Фальсификация

source: bWAPP - iFrame Injection
ru_ru: BWAPP - iFrame инъекция

source: iFrame Injection
ru_ru: iFrame инъекция

source: bWAPP - Info
ru_ru: BWAPP - Информация

source: bWAPP, or a
ru_ru: BWAPP или

source: buggy web application
ru_ru: уязвимое веб-приложение

source: , is a free and open source deliberately insecure web application.
ru_ru: является свободным и открытым исходным кодом намеренно небезопасного веб-приложения.

source: It helps security enthusiasts, developers and students to discover and to prevent web vulnerabilities.
ru_ru: Оно помогает энтузиастам в области безопасности, разработчикам и студентам обнаружить и предотвратить уязвимости в интернете.

source: bWAPP prepares one to conduct successful penetration testing and ethical hacking projects.
ru_ru: BWAPP готовит человека к проведению успешного тестирования на проникновение и этических хакерских проектов.

source: What makes bWAPP so unique? Well, it has over 100 web vulnerabilities!
ru_ru: Что делает BWAPP таким уникальным? Ну, он имеет более 100 веб-уязвимостей!

source: It covers all major known web bugs, including all risks from the
ru_ru: Он охватывает все основные известные веб-ошибки, включая все риски, связанные с

source: OWASP
ru_ru: Open Web Application Security Project (Открытым Проектом Безопасности Веб-Приложения), а именно

source: Top 10 project.
ru_ru: топ-10 проектов.

source: bWAPP is a PHP application that uses a MySQL database. It can be hosted on Linux, Windows and Mac with Apache/IIS and MySQL. It can also be installed with WAMP or XAMPP.
ru_ru: BWAPP-это PHP-приложение, которое использует базу данных MySQL. Оно может быть размещено на Linux, Windows и Mac с Apache / IIS и MySQL. Его можно также установить с WAMP или XAMPP.

source: Another possibility is to download the
ru_ru: Другая возможность заключается в загрузке

source: , a custom Linux VM pre-installed with bWAPP.
ru_ru: пользовательской виртуальной машины Linux с предустановленным BWAPP.

source: introduction tutorial, including free exercises...
ru_ru: вводный курс, в том числе бесплатные упражнения...

source: bWAPP is for educational purposes. Education, the most powerful weapon which we can use to change the world. Have fun with this free and open source project!
ru_ru: BWAPP предназначен для образовательных целей. Образование - самое мощное оружие, которое мы можем использовать, чтобы изменить мир. Удачи с этим бесплатным и открытым исходным кодом проекта!

source: Cheers, Malik Mesellem
ru_ru: За ваше здоровье, Малик Меселлем

source: bWAPP - Information Disclosure
ru_ru: BWAPP - Раскрытие информации

source: Information Disclosure - PHP version
ru_ru: Раскрытие информации - Версия PHP

source: Information Disclosure - Headers
ru_ru: Раскрытие информации - Заголовки

source: Information Disclosure - Robots File
ru_ru: Раскрытие информации - Индексный файл

source: bWAPP - Security Misconfiguration
ru_ru: bWAPP - неправильная настройка безопасности

source: Cross-Site Tracing (XST)
ru_ru: Трассировка между сайтами (XST)

source: bee-box only
ru_ru: только bee-box

source: Cookie stealing is possible using XST, even if the HTTPOnly flag is set.
ru_ru: Кража cookie возможна с использованием XST, даже если установлен флаг HTTPOnly.

source: HINT: try to
ru_ru: ЦЕЛЬ: попытаться

source: steal the session cookie using XSS. Modern browsers aret not vulnerable...
ru_ru: украсть файл cookie сеанса с помощью XSS. Современные браузеры не уязвимы....

source: bWAPP - Portal
ru_ru: bWAPP портал

source: Portal
ru_ru: Портал

source: bWAPP, or a buggy web application, is a free and open source deliberately insecure web application.
ru_ru: bWAPP, или веб-приложение с ошибками, является намеренно незащищенным веб-приложением с открытым исходным кодом.

source: bWAPP covers all major known web vulnerabilities, including all risks from the OWASP Top 10 project!
ru_ru: bWAPP покрывает все основные известные веб-уязвимости, включая все риски, связанные с проектом OWASP Top 10!

source: It is for security-testing and educational purposes only
ru_ru: Он создан только для тестирования безопасности и образовательных целей

source: Which bug do you want to hack today? :)
ru_ru: Что будем взламывать сегодня ? :)

source: Hack
ru_ru: Взломать

source: Information Disclosure - Favicon
ru_ru: Раскрытие информации- Фавикон

source: HTML5 Web Storage (Secret)
ru_ru: Веб-хранилище HTML5 (Секретное)

source: Your login name and secret have been stored as HTML5 web storage!
ru_ru: Ваш логин и секрет были сохранены как веб-хранилище HTML5!

source: HINT: try to grab it using XSS...
ru_ru: СОВЕТ: попробуйте захватить его с помощью XSS ...

source: bWAPP - Sensitive Data Exposure
ru_ru: BWAPP - Незащищенность критичных данных

source: Text Files (Accounts)
ru_ru: Текстовые файлы (Учетные записи)

source: Insert a new account into a text file:
ru_ru: Вставьте новую учетную запись в текстовый файл:

source: Username:
ru_ru: Имя пользователя:

source: Please enter both fields...
ru_ru: Пожалуйста заполните оба поля...

source: Download
ru_ru: Скачать

source: the file.
ru_ru: файл.

source: Delete
ru_ru: Удалить

source: Base64 Encoding (Secret)
ru_ru: Кодировка Base64 (Секретная)

source: Your secret has been stored as an encrypted cookie!
ru_ru: Ваш секрет был сохранен в виде зашифрованного файла cookie!

source: HINT: try to decrypt it...
ru_ru: ПОДСКАЗКА: попробуйте расшифровать его...

source: bWAPP - Insecure DOR
ru_ru: BWAPP - Небезопасные прямые ссылки на объекты

source: Insecure DOR (Change Secret)
ru_ru: Небезопасные прямые ссылки на объекты (Изменить секрет)

source: Insecure DOR (Order Tickets)
ru_ru: Небезопасные прямые ссылки на объекты (Заказ билетов)

source: Insecure DOR (Reset Secret)
ru_ru: Небезопасные прямые ссылки на объекты (Сбросить секрет)

source: Reset your secret to
ru_ru: Сбросьте свой секрет на

source: bWAPP - Insecure iFrame
ru_ru: BWAPP - Небезопасный плавающий фрейм (iFrame)

source: Insecure iFrame (Login Form)
ru_ru: Небезопасный плавающий фрейм (Форма входа)

source: bWAPP - Insufficient Transport Layer Protection
ru_ru: BWAPP - Недостаточная защита транспортного уровня

source: Clear Text HTTP (Credentials)
ru_ru: Открытый текст HTTP (Учетные данные)

source: SSL 2.0 Deprecated Protocol
ru_ru: SSL 2.0 устаревший протокол

source: The web server encrypts traffic using an old deprecated protocol with known weaknesses.
ru_ru: Веб-сервер шифрует трафик, используя устаревший протокол с известными недостатками.

source: Disable SSL 2.0, use SSL 3.0 or TLS 1.x instead!
ru_ru: Отключите SSL 2.0, используйте SSL 3.0 или TLS 1.x вместо этого!

source: HINT: test the SSL connection with the
ru_ru: ПОДСКАЗКА: проверьте SSL соединение с помощью

source: tool...
ru_ru: инструмента...

source: BEAST/CRIME/BREACH Attacks
ru_ru: Атаки на SSL/TLS - BEAST/CRIME/BREACH

source: The Lighttpd web server is vulnerable to the BEAST, CRIME and BREACH attacks.
ru_ru: Веб-сервер Lighttpd уязвим для атак BEAST/CRIME/BREACH

source: Configure TLS 1.1 or above, disable SSL and HTTP compression!
ru_ru: Настройте протокол TLS 1.1 или выше, отключите сжатие SSL и HTTP!

source: HINT: test the SSL connection on port 9443 with the
ru_ru: ПОДСКАЗКА: проверьте SSL соединение на порту 9443 с помощью

source: POODLE Vulnerability
ru_ru: Уязвимость POODLE

source: The web server is vulnerable to the POODLE attack.
ru_ru: Веб-сервер уязвим для атаки POODLE.

source: If disabling SSLv3 is not an option, then consider implementing TLS_FALLBACK_SCSV.
ru_ru: Если отключение SSLv3 не предоставляется возможным, то рассмотрите возможность реализации TLS_FALLBACK_SCSV.

source: More info:
ru_ru: Больше информации:

source: Exploiting The SSL 3.0 Fallback
ru_ru: Использование резервной версии SSL 3.0

source: Insuff. Transport Layer Protection
ru_ru: Недостаточная защита транспортного уровня

source: bWAPP is for educational purposes only / Follow
ru_ru: bWAPP предназначен только для образовательных целей / Подписывайтесь

source: bWAPP - LDAP Connection Settings
ru_ru: BWAPP - Настройки подключения LDAP

source: LDAP Connection Settings
ru_ru: Настройки подключения LDAP

source: Configure your LDAP connection settings (requires the PHP LDAP extension).
ru_ru: Настройте параметры подключения LDAP (требуется расширение PHP LDAP).

source: The credentials will be sent in clear text!
ru_ru: Учетные данные будут отправлены в виде открытого текста!

source: Server:
ru_ru: Сервер:

source: Base DN:
ru_ru: База поиска:

source: bWAPP - LDAP Injection
ru_ru: BWAPP - LDAP инъекция

source: LDAP Injection (Search)
ru_ru: LDAP инъекция (Поиск)

source: Search for a user account:
ru_ru: Поиск учетной записи пользователя:

source: LDAP Connection Setting
ru_ru: Настройка соединения LDAP

source: bWAPP - SQLiteManager Local File Inclusion
ru_ru: bWAPP - Локальное включение файлов SQLiteManager

source: SQLiteManager Local File Inclusion
ru_ru: Локальное включение файлов SQLiteManager

source: version
ru_ru: Версия

source: is vulnerable to Local File Inclusion!
ru_ru: уязвима для локального включения файлов!

source: HINT: I love
ru_ru: ПОДСКАЗКА: Я люблю

source: bWAPP - Mail Header Injection
ru_ru: bWAPP - Инъекция заголовка почты

source: Mail Header Injection (SMTP)
ru_ru: Инъекция заголовка почты (SMTP)

source: E-mail us your questions at
ru_ru: Напишите нам свои вопросы на

source: Remarks:
ru_ru: Примечания:

source: bWAPP - Manual Intervention Required!
ru_ru: bWAPP - требуется ручное вмешательство!

source: Manual Intervention Required!
ru_ru: Требуется ручное вмешательство!

source: Pass the CAPTCHA before proceeding to
ru_ru: Передайте CAPTCHA, прежде чем перейти

source: Proceed
ru_ru: Продолжить

source: The current date on your computer is:
ru_ru: Текущая дата на компьютере:

source: XSS - Reflected (Custom Header)
ru_ru: Поиск фильма:

source: Some web clients use custom HTTP request headers...
ru_ru: Некоторые веб-клиенты используют разнообразные HTTP заголовки:

source: Content of our
ru_ru: Содержимое

source: headers
ru_ru: заголовки

source: XSS - Reflected (Back Button)
ru_ru: Отраженный XSS (кнопка назад)

source: Click the button to go to back to the previous page:
ru_ru: Нажмите на кнопку назад, чтобы перейти на предыдущую страницу

source: The phpMyAdmin version fails to validate BBcode tags in the error.php script!
ru_ru: Версии phpMyAdmin не удалось проверить тэги BBcodе в скрипте error.php

source: XSS - Stored (User-Agent)
ru_ru: XSS - сохранненный (Юзер - агент 007)

source: Your IP address and User-Agent string have been logged into the database!
ru_ru: Ваш IP адрес и юзер-агент были сохранены в базе данных!

source: log file)
ru_ru: файл логов)

source: IP Address
ru_ru: IP адрес

source: User-Agent
ru_ru: Юзер агент

source: An overview of our latest visitors:
ru_ru: Обзор последних посетителей:

source: bWAPP - Talks & Training
ru_ru: BWAPP - Обсуждение и обучение

source: We are happy to give bWAPP talks and workshops at your security convention or seminar!
ru_ru: Мы будем рады провести переговоры и семинары bWAPP на вашей конференции или семинаре по безопасности!

source: This year we were at
ru_ru: В этом году мы были на

source: Infosecurity Belgium
ru_ru: Информационная безопасность Бельгии

source: and the
ru_ru: и на

source: TDI Symposium
ru_ru: Симпозиуме по доверенной цифровой идентификации (TDI)
