Repository: ilzyukin/bwapp2
Catalog: messages.po
Languages: ru_ru

source: Interested in hands-on skills training? We offer the following exclusive courses and workshops:
ru_ru: Заинтересованы в практическом обучении навыкам? Мы предлагаем следующие эксклюзивные курсы и семинары:

source: All our courses and workshops can be scheduled on demand, at your location.
ru_ru: Все наши курсы и семинары могут быть запланированы по вашему запросу, в вашей локации.

source: Don't hesitate to contact us for price information.
ru_ru: Не стесняйтесь обращаться к нам за информацией о ценах.

source: Hope to see you soon!
ru_ru: Надеюсь увидеть вас в ближайшее время!

source: Your security level is
ru_ru: Ваш уровень безопасности

source: Check security_level
ru_ru: Проверьте уровень безопасности

source: Set the security level:
ru_ru: Установите уровень безопасности

source: not set
ru_ru: не установлен

source: bWAPP - SQL Injection
ru_ru: bWAPP - SQL инъекция

source: SQL Injection (GET/Search)
ru_ru: SQL инъекция (GET/Поиск)

source: No movies were found!
ru_ru: Никаких фильмов не нашли!

source: Link
ru_ru: Ссылка

source: SQL Injection (GET/Select)
ru_ru: SQL инъекция (GET/Выбор)

source: Select a movie:
ru_ru: Выберите фильм:

source: SQL Injection (Login Form/Hero)
ru_ru: SQL инъекция (Форма Входа / Герой)

source: Enter your 'superhero' credentials.
ru_ru: Введите свои учетные данные.

source: SQL Injection - Blind - Boolean-Based
ru_ru: SQL инъекция - Слепая логическая инъекция

source: SQL Injection - Blind (WS/SOAP)
ru_ru: SQL инъекция - Слепая (WS/SOAP) инъекция

source: SQL Injection (POST/Search)
ru_ru: SQL инъекция (POST/Поиск)

source: SQL Injection - Stored (Blog)
ru_ru: SQL инъекция - Сохраненный (Блог)

source: Add an entry to our blog:
ru_ru: Добавьте запись в наш блог:

source: Add Entry
ru_ru: Добавить запись

source: SQL Injection - Stored (XML)
ru_ru: SQL инъекция - Сохраненный (XML)

source: SQL Injection (CAPTCHA)
ru_ru: SQL инъекция (Капча)

source: Done!
ru_ru: Готово!

source: SQL Injection (AJAX/JSON/jQuery)
ru_ru: SQL инъекция (AJAX/JSON/jQuery)

source: SQL Injection (SQLite)
ru_ru: SQL инъекция (SQLite)

source: (requires the PHP SQLite module)
ru_ru: (требуется модуль PHP SQLite)

source: SQL Injection - Stored (SQLite)
ru_ru: SQL инъекция - Сохраненный (SQLite)

source: Delete Entries
ru_ru: Удаление записей

source: SQL Injection (POST/Select)
ru_ru: SQL инъекция (POST/Выбор)

source: SQL Injection - Blind (SQLite)
ru_ru: SQL инъекция - Слепая (SQLite)

source: SQL Injection - Blind - Time-Based
ru_ru: SQL инъекция - Слепая - Основанная на времени

source: The result will be sent by e-mail...
ru_ru: Результат был отправлен на Вашу почту...

source: SQL Injection (Login Form/User)
ru_ru: SQL инъекция (Поле Логин/Пользователь)

source: SQL Injection - Stored (User-Agent)
ru_ru: SQL-инъекция - Хранилище (User-Agent)

source: Your IP address and User-Agent string have been logged into the database!
ru_ru: Ваш IP-адрес и строка User-Agent были зарегистрированы в базе данных!

source: bWAPP - Drupal SQL Injection
ru_ru: bWAPP - Drupal SQL-инъекция

source: Drupal SQL Injection (Drupageddon)
ru_ru: Drupal SQL-инъекция (Drupageddon)

source: version is vulnerable to SQL injection!
ru_ru: версия уязвима для SQL-инъекций!

source: bWAPP - PHP CGI Remote Code Execution
ru_ru: bWAPP - PHP CGI Удаленное выполнение кода

source: PHP CGI Remote Code Execution
ru_ru: PHP CGI Удаленное выполнение кода

source: directory is using PHP in CGI mode. (
ru_ru: каталог использует PHP в режиме CGI. (

source: HINT: a public
ru_ru: ПОДСКАЗКА: публичный

source: is available...
ru_ru: доступен

source: version is vulnerable to SQL injection!
ru_ru: версия уязвима для SQL-инъекции!

source: Transfer
ru_ru: Перевод

source: bWAPP - SQLiteManager PHP Code Injection
ru_ru: bWAPP - SQLiteManager PHP инъекция кода

source: SQLiteManager PHP Code Injection
ru_ru: SQLiteManager PHP Инъекция кода

source: version is vulnerable to remote PHP code injection! (
ru_ru: версия уязвима для удаленного внедрения кода PHP! (

source: There's nothing to disclose!
ru_ru: Тут нечего раскрывать!

source: Check the server headers...
ru_ru: Проверьте заголовки сервера...

source: Some default favicons are disclosing the web framework...
ru_ru: Некоторые фавиконы по умолчанию раскрывают веб-фреймворк...
